Autodesk.Revit.UI.ComboBox.CurrentChanged
Subscribe to this event to be notified when the current item of the ComboBox is changed.

Autodesk.Revit.UI.ComboBox.DropDownClosed
Subscribe to this event to be notified when the drop-down of the ComboBox is closed.

Autodesk.Revit.UI.ComboBox.DropDownOpened
Subscribe to this event to be notified when the drop-down of the ComboBox is opened.

Autodesk.Revit.UI.ComboBox.GetItems
Gets the copy of a collection of the ComboBoxMembers assigned to the ComboBox.
Since: 2011

Autodesk.Revit.UI.ComboBox.AddSeparator
Adds a separator to the drop-down list.
Remarks: The separator will be added below the last added member.
Since: 2011

Autodesk.Revit.UI.ComboBox.AddItems(System.Collections.Generic.IList{Autodesk.Revit.UI.ComboBoxMemberData})
Adds a new items to the ComboBox.
memberData: An object list containing the data needed to construct the ComboBoxMember.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when memberData is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when button with memberData.Name already exists in the drop-down list.
Returns:  The newly added ComboBoxMembers.
Since: 2011

Autodesk.Revit.UI.ComboBox.AddItem(Autodesk.Revit.UI.ComboBoxMemberData)
Adds a new item to the ComboBox.
memberData: An object containing the data needed to construct the ComboBoxMember.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when memberData is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when button with memberData.Name already exists in the drop-down list.
Returns:  The newly added ComboBoxMember.
Since: 2011

Autodesk.Revit.UI.ComboBox.Image
The image shown on the ComboBox.
Remarks: The image will be shown on the left side of the item.
The best size is 16 x 16 pixels.
Since: 2011

Autodesk.Revit.UI.ComboBox.Current
Gets or sets the current checked ComboBox member of the ComboBox.
Remarks:
The default value is the first ComboBox member added to the ComboBox.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when trying to set this property to null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when trying to set this property to a button not in this ComboBox.
Since: 2011

Autodesk.Revit.UI.ComboBox
This class represents a selection control with a drop-down list that can be shown or hidden by clicking the arrow.
Remarks: The order of items shown in the ComboBox depends upon the order which they were added, unless the ComboBoxMembers have been assigned to groups.
If the members have been assigned groups, they will be sorted to fall under their groups regardless of the order in which they were added.
Use of this class is not supported in Revit Macros.
Since: 2011